//=============================================================================
//
// 地面処理 [field.h]
// Author : 今川乃流
//
//=============================================================================
#ifndef _FIELD_H_
#define _FIELD_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_FIELD	"data/TEXTURE/field000.jpg"						// 読み込むテクスチャファイル名

#define	SIZE_X			(200.0f)										// 地面のサイズ(X方向)
#define	SIZE_Z			(200.0f)										// 地面のサイズ(Z方向)


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);

#endif
