//=============================================================================
//
// 家具処理 [furniture.h]
// Author : GP12A295-19-千坂浩太
//
//=============================================================================
#ifndef _FURNITURE_H_
#define _FURNITURE_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_FURNITURE				(32)						// 家具最大数

//**************************************
// 種類
//**************************************
enum
{
	kabin = 0,		// 花瓶
	isu,			// 椅子
	buta,			// 豚の貯金箱
	yubiwa,			// 指輪
	toire,			// トイレ
	tukue,			// 机
	terebi,			// テレビ
	kinko,			// 金庫
	tansu,			// タンス
	bed,			// ベッド
	FURNITURE_MAX
};

//*****************************************************************************
// クラス定義
//*****************************************************************************
class FURNITURE
{
public:
	bool		use;				// 使用しているかどうか

	D3DXVECTOR3	pos;				// 現在の位置
	D3DXVECTOR3	rot;				// 現在の向き
	D3DXVECTOR3	scl;				// スケール

	int			type;				// 種類
	int			house_num;			// 所属している家の番号
	float		weight;				// 重さ
	int			price;				// 金額
	int			ratio;				// 確率
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFurniture(int nType);
void UninitFurniture(void);
void UpdateFurniture(void);
void DrawFurniture(void);
FURNITURE *GetFurniture(int no);

#endif
