//=============================================================================
//
// ゲーム処理 [game.h]
// Author : GP12B295 29 山口輝明
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

/*******************************************************************************
* 構造体定義
*******************************************************************************/

enum
{
	GAME_FIELD,
	GAME_SEARCH,
	GAME_SHADOW,
	GAME_PLAYER,
	GAME_POLICE,
	GAME_WALL,
	GAME_HOME,
	GAME_FURNITURE,
	GAME_GETUI,
	GAME_WWWW,
	GAME_TIMEEFF,
	GAME_CLOCK,
	GAME_WEIGHT,
	GAME_VOICE,
	GAME_ARREST,
	GAME_BUTTON,
	GAME_DRAW_MAX,

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGame(int nType);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

#endif
