
//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 今川乃流
//
//=============================================================================
//#ifndef _MODE_H_
//#define _MODE_H_
//
//#include "main.h"
//
////*****************************************************************************
//// マクロ定義
////*****************************************************************************
//#define	TEXTURE_MODE		"data/TEXTURE/HHD_title.jpg"		// 読み込むテクスチャファイル名
//
//#define	MODE_POS_X		(20)		// タイトルロゴの位置(X座標)
//#define	MODE_POS_Y		(10)		// タイトルロゴの位置(Y座標)
//#define	MODE_WIDTH		(SCREEN_WIDTH)		// タイトルロゴの幅
//#define	MODE_HEIGHT		(SCREEN_HEIGHT)		// タイトルロゴの高さ
//
////*****************************************************************************
//// プロトタイプ宣言
////*****************************************************************************
//HRESULT InitMode(void);
//void UninitMode(void);
//void UpdateMode(void);
//void DrawMode(void);
//
//#endif