//=============================================================================
//
// ランキング処理 [ranking.h]
// Author : GP12A295-19-千坂浩太
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	RANKING_CSV		"data/EXCEL_DATA/ranking.csv"	// 読み込むファイル名
#define RANKING_MAX		(3)								// ランキング構造体配列の最大数
//*****************************************************************************
// クラス定義
//*****************************************************************************
class RANKING
{
public:
	int			id;
	int			rank;
	long long	score;
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
RANKING *GetRanking(int no);
int GetRankingCnt(void);
void WriteRankingCsv(void);
void LoadRankingCsv(void);
void Ranking(void);

#endif
