//=============================================================================
//
// 索敵範囲描画処理 [search.h]
// Author : GP12A295-19-千坂浩太
//
//=============================================================================
#ifndef _SEARCH_H_
#define _SEARCH_H_
#include "main.h"
#include "police.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_SEARCH	"data/TEXTURE/white.png"	// 読み込むテクスチャファイル名
#define	SEARCH_MAX		(POLICE_MAX)				// 索敵範囲の最大数
#define	SEARCH_LENGTH	(100.0f)					// 索敵距離
#define	SEARCH_ANGLE	(D3DX_PI / 3.0f)			// 索敵視野角
//*****************************************************************************
// クラス定義
//*****************************************************************************
class SEARCH :public POLICE		// サーチクラス
{
public:
	float	cos;				// コサイン
	float	sita;				// 索敵角度
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSearch(int nType);
void UninitSearch(void);
void UpdateSearch(void);
void DrawSearch(void);
#endif
